'''Объявите класс Box3D для представления прямоугольного параллелепипеда (бруска),
объекты которого создаются командой:
box = Box3D(width, height, depth)
где width, height, depth - ширина, высота и глубина соответственно (числа: целые или вещественные)
В каждом объекте класса Box3D должны создаваться публичные атрибуты:
width, height, depth - ширина, высота и глубина соответственно.
С объектами класса Box3D должны выполняться следующие операторы:
box1 = Box3D(1, 2, 3)
box2 = Box3D(2, 4, 6)
box = box1 + box2 # Box3D: width=3, height=6, depth=9 (соответствующие размерности складываются)
box = box1 * 2    # Box3D: width=2, height=4, depth=6 (каждая размерность умножается на 2)
box = 3 * box2    # Box3D: width=6, height=12, depth=18
box = box2 - box1 # Box3D: width=1, height=2, depth=3 (соответствующие размерности вычитаются)
box = box1 // 2   # Box3D: width=0, height=1, depth=1 (соответствующие размерности целочисленно делятся на 2)
box = box2 % 3    # Box3D: width=2, height=1, depth=0
При каждой арифметической операции следует создавать новый объект
класса Box3D с соответствующими значениями локальных атрибутов.'''
